/**
 * জাভাস্ক্রিপ্টে Destructuring এবং Rest Pattern মূলত যমজ ভাইয়ের মতো—তারা একসাথে কাজ করে ডেটাকে গুছিয়ে রাখতে এবং কোডকে ক্লিন করতে সাহায্য করে।
 * 
 * Destructuring: একটা বড় প্যাকেট (অ্যারে বা অবজেক্ট) খুলে ভেতরের জিনিসগুলো আলাদা আলাদা ভেরিয়েবলে রাখা।

Rest Pattern (...): নির্দিষ্ট কিছু জিনিস নেওয়ার পর বাকি যা পড়ে থাকে, সেগুলোকে এক জায়গায় জড়ো করে রাখা।
 * 
 */

const fruits = ["Mango", "Banana", "Apple", "Orange", "Grapes", "Jackfruit"];

const [first, second, third, ...others] = fruits;

console.log(first);
console.log(second);
console.log(third);
console.log(others);

/**
 * অবজেক্টের ক্ষেত্রেও Rest Pattern একইভাবে কাজ করে, তবে এখানে ইনডেক্স বা সিরিয়ালের বদলে আমরা প্রপার্টি বা কি (Key) ব্যবহার করি।

সহজ কথায়: আপনি নির্দিষ্ট কিছু প্রপার্টি আলাদা করবেন, আর বাকি সব প্রপার্টি একটি নতুন অবজেক্টে জমা হয়ে যাবে।
 */

const developer = {
  fullName: "Arif Ahmed",
  age: 26,
  skill: "JavaScript",
  location: "Dhaka",
  isRemote: true,
};

const { fullName, age, ...otherInfo } = developer;

console.log(fullName);
console.log(age);
console.log(otherInfo);

/**কার্লি ব্র্যাকেট { }: অবজেক্টের ক্ষেত্রে আমরা থার্ড ব্র্যাকেট [ ] এর বদলে কার্লি ব্র্যাকেট ব্যবহার করি।

নাম মিল থাকতে হবে: অ্যারের মতো এখানে সিরিয়াল জরুরি নয়, তবে প্রপার্টির নাম (Key) অবশ্যই অবজেক্টের নামের সাথে মিল থাকতে হবে (যেমন: fullName থেকে ডাটা নিতে হলে ভেরিয়েবলের নামও fullName হতে হবে)।

Rest Operator (...): এখানেও তিনটি ডট ব্যবহার করে extraInfo (বা যেকোনো নাম) দিলে বাকি সব প্রপার্টি ওই অবজেক্টে চলে যাবে। */

/**সংক্ষেপে মনে রাখার কৌশল:
যদি দেখ ডটগুলো ইকুয়াল চিহ্নের পরে বা ফাংশন কলে আছে, তবে সেটা Spread (ছড়িয়ে দিচ্ছে)।

যদি দেখ ডটগুলো ডিস্ট্রাকচারিং ব্র্যাকেটের ভেতর বা ফাংশন প্যারামিটারে আছে, তবে সেটা Rest (জমা করছে)। */
